DiplomT/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_КоличествоДнейОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomT/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СписокОтпусков = ПоместитьОтпускаСотрудниковВременноеХранилище();	
	ВыбранноеЗначение = Новый Структура();
    ВыбранноеЗначение.Вставить("СписокОтпусков", СписокОтпусков );
    
	
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ВыбранноеЗначение, Элементы.ОтпускаСотрудников,
	 , , , , );
	
	
	
КонецПроцедуры


&НаСервере
Функция ПоместитьОтпускаСотрудниковВременноеХранилище()
	
	ТабОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить();
	
		
 АдресВХ = ПоместитьВоВременноеХранилище(ТабОтпускаСотрудников, УникальныйИдентификатор);
 
Возврат АдресВХ

КонецФункции

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	
	СколькоДнейОтпуска = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала) / 86400;
	
	ТекДанные.КоличествоДнейОтпуска = СколькоДнейОтпуска;
	
	
КонецПроцедуры
